Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_canfd.h
 /**   
  *******************************************************************************************************
  * @file    fm33ld5xx_fl_canfd.h
  * @author  FMSH Application Team
  * @brief   Head file of CANFD FL Module 
  *******************************************************************************************************   
  * @attention    
  * Copyright (c) 2023, SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICROELECTRONICS./ FUDAN MICRO.)    
  * All rights reserved.    
  *    
  * Processor:                   FM33ld5xx    
  * http:                        http://www.fmdevelopers.com.cn/    
  *    
  * Redistribution and use in source and binary forms, with or without    
  * modification, are permitted provided that the following conditions are met    
  *    
  * 1. Redistributions of source code must retain the above copyright notice,    
  *    this list of conditions and the following disclaimer.    
  *    
  * 2. Redistributions in binary form must reproduce the above copyright notice,    
  *    this list of conditions and the following disclaimer in the documentation    
  *    and/or other materials provided with the distribution.    
  *    
  * 3. Neither the name of the copyright holder nor the names of its contributors    
  *    may be used to endorse or promote products derived from this software    
  *    without specific prior written permission.    
  *    
  * 4. To provide the most up-to-date information, the revision of our documents     
  *    on the World Wide Web will be the most Current. Your printed copy may be      
  *    an earlier revision. To verify you have the latest information avaliable,    
  *    refer to: http://www.fmdevelopers.com.cn/.    
  *    
  * THIS SOFTWARE IS PROVIDED BY FUDAN MICRO "AS IS" AND ANY EXPRESSED:     
  * ORIMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES     
  * OF MERCHANTABILITY NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE    
  * ARE DISCLAIMED.IN NO EVENT SHALL FUDAN MICRO OR ITS CONTRIBUTORS BE LIABLE     
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL     
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS     
  * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER    
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,     
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISINGIN ANY WAY OUT OF THE     
  * USE OF THIS SOFTWARE, EVEN IF ADVISED OFTHE POSSIBILITY OF SUCH DAMAGE.    
  *
  *******************************************************************************************************
  */    

/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33LD5XX_FL_CANFD_H
#define __FM33LD5XX_FL_CANFD_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33ld5xx_fl_def.h"
/** @addtogroup FM33LD5XX_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup CANFD_FL_ES_INIT CANFD Exported Init structures
  * @{
  */

/**
  * @brief FL CANFD Init Sturcture definition
  */
    
extern const uint8_t RXMB_INDEX_START[4];
    
#define CANFD_NUM(x)    (((x)==CANFD0) ? 0 : 1)
#define RXMB_NUM(x)     ((x) >> 3)
#define RXMB_INDEX(x)   ((x) - RXMB_INDEX_START[RXMB_NUM(x)])
    
	

typedef struct
{
    CANFD_RX_FIFO_Type         * RX_FIFO;
    CANFD_COMMON_FIFO_Type     * COMMON_FIFO;
    CANFD_TX_MESSAGE_Type      * TX_MESSAGE;
    CANFD_TX_HISTORY_LIST_Type * TX_HISTORY_LIST;
    CANFD_RX_MESSAGE_Type      * RX_MESSAGE[4];
}CANFD_BUFFER_TYPE;

extern const CANFD_BUFFER_TYPE CANFD_BUFFER[1];

/*Buffer宏定义*/
#define RF(x, num)    (CANFD_BUFFER[CANFD_NUM(x)].RX_FIFO->CFDRF[num])
#define CF(x)         (CANFD_BUFFER[CANFD_NUM(x)].COMMON_FIFO)
#define TM(x, num)    (CANFD_BUFFER[CANFD_NUM(x)].TX_MESSAGE->CFDTM[num])
#define THL(x)        (CANFD_BUFFER[CANFD_NUM(x)].TX_HISTORY_LIST)
#define RM(x, num)    (CANFD_BUFFER[CANFD_NUM(x)].RX_MESSAGE[RXMB_NUM(num)]->CFDRM[RXMB_INDEX(num)])




//RxMessage.ID = 
//RM(CANFD0, 0).CFDRMIDb;
//RM(x, num) = CANFD_BUFFER[0].RX_MESSAGE[RXMB_NUM(0)]->CFDRM[RXMB_INDEX(0)]

/*RxMB配置*/
typedef struct
{
    /*RxMB负载大小配置*/
    uint32_t payloadDataSize;    
    /*RxMB数目*/
    uint32_t rxmbNum;    
}FL_CANFD_RxMB_CfgTypeDef;

/*RxFIFO配置*/
typedef struct
{
    /*中断产生水位*/
    uint32_t intGenCounterValue;
    /*中断模式*/
    uint32_t intMode;
    /*FIFO深度*/
    uint32_t fifoDepth;    
    /*负载大小配置*/
    uint32_t payloadDataSize;
    /*中断使能*/
    FL_FunState intEnable;
    /*CommonFIFO是否使能*/
    FL_FunState Enable;    
}FL_CANFD_RxFIFO_CfgTypeDef;

/*CommonFIFO配置*/
typedef struct
{
    /*发送间隔*/
    uint32_t txInterval;
    /*FIFO深度*/
    uint32_t fifoDepth;
    /*发送用TxMB链接*/
    uint32_t txmbLink;
    /*中断产生水位*/
    uint32_t intGenCounterValue;
    /*中断模式*/
    uint32_t intMode;
    /*内部定时器分辨率*/
    uint32_t intervalTimerResolution;
    /*内部定时器源*/
    uint32_t intervalTimerSource;
    /*FIFO模式*/
    uint32_t fifoMode;
    /*负载大小配置*/
    uint32_t payloadDataSize;
    /*中断使能*/
    FL_FunState intEnable;
    /*CommonFIFO是否使能*/
    FL_FunState Enable;   
}FL_CANFD_CommonFIFO_CfgTypeDef;

/*TxQueue配置*/
typedef struct
{
    /*队列深度*/
    uint32_t queueDepth;
    /*中断模式*/
    uint32_t intMode;
    /*中断使能*/
    FL_FunState intEnable;
    /*TxQueue是否使能*/
    FL_FunState Enable;   
}FL_CANFD_TxQueue_CfgTypeDef;

/*TxHistoryList配置*/
typedef struct
{
    /*TxHistoryList专用Tx是否使能*/
    FL_FunState dedicatedTxEnable;    
    /*中断模式*/
    uint32_t intMode;
    /*中断使能*/
    FL_FunState intEnable;
    /*TxHistoryList是否使能*/
    FL_FunState Enable;   
}FL_CANFD_TxHistoryList_CfgTypeDef;

/**
  * @brief  CANFD Acceptance filter config structure definition
  */
typedef struct
{
    /*IDE*/
    uint32_t filterIDE;
    /*RTR*/
    uint32_t filterRTR;
    /*ID*/
    uint32_t filterID;
    
    /*IDEM*/
    uint32_t filterIDEMask;
    /*RTRM*/
    uint32_t filterRTRMask;
    /*IDM*/
    uint32_t filterIDMask;
    
