Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_canfd.h
    /*RxMB配置*/
    /*RxMB有效使能*/
    uint32_t rxmbValid;    
    /*接收用RxMB编号*/
    uint32_t rxmbNum;
    /*接收长度*/
    uint32_t dlc;
    
    /*CommonFIFO和RxFIFO接收使能*/
    /*CommonFIFO接收使能*/
    FL_FunState commonfifoRecvEnable;
    /*RxFIFO接收使能*/
    FL_FunState rxfifo0RecvEnable;
    FL_FunState rxfifo1RecvEnable;

    /*滤波器使能*/
    FL_FunState  filterEnable;
} FL_CANFD_AcceptanceFilter_CfgTypeDef;



/**
  * @brief  CANFD Acceptance filter config structure definition
  */
typedef struct
{
    /*IDE*/
    uint32_t PFL_IDE;
    /*RTR*/
    uint32_t PFL_RTR;
    /*ID*/
    uint32_t PFL_ID;
    
    /*IDEM*/
    uint32_t PFL_IDEMask;
    /*RTRM*/
    uint32_t PFL_RTRMask;
    /*IDM*/
    uint32_t PFL_IDMask;
    
    /*RxMB配置*/
    /*RxMB有效使能*/
    uint32_t PFL_rxmbValid;    
    /*接收用RxMB编号*/
    uint32_t PFL_rxmbNum;
    /*接收长度*/
    uint32_t PFL_dlc;
    
    /*CommonFIFO和RxFIFO接收使能*/
    /*CommonFIFO接收使能*/
    FL_FunState PFL_commonfifoRecvEnable;
    /*RxFIFO接收使能*/
    FL_FunState PFL_rxfifo0RecvEnable;
    FL_FunState PFL_rxfifo1RecvEnable;

	/* PFL Payload 设置 */
	uint32_t PFL_AND_OR; 		/* 0:both of filter,	1:one of filter */
	/* filter0 payload 设置*/
	uint32_t PFL_GPFLRANG0;		/* 0:match,				1:upper/lower  */
	uint32_t PFL_GPFLOUT0;		/* 0:within range,		1:outside of range */
	uint32_t PFL_OFFSET0;
	/* filter1 payload 设置*/
	uint32_t PFL_GPFLRANG1;
	uint32_t PFL_GPFLOUT1;	
	uint32_t PFL_OFFSET1;
	/* payload data and mask 设置  */
	uint32_t PFL_Payload_Data0;
	uint32_t PFL_Payload_Data0Mask;
	uint32_t PFL_Payload_Data1;
	uint32_t PFL_Payload_Data1Mask;
	
    /*滤波器使能*/
    FL_FunState  PFL_Enable;
	
} FL_CANFD_PFL_CfgTypeDef;
/**
  * @brief FL CANFD Init Sturcture definition
  */
typedef struct
{
    /*全局模式*/
    uint32_t globalMode;
    /*通道模式*/
    uint32_t channelMode;
    
    /*标称位速率同步段长度*/
    uint32_t NB_SJW;
    /*标称位速率时间段1*/
    uint32_t NB_TS1;
    /*标称位速率时间段2*/
    uint32_t NB_TS2;
    /*标称位速率波特率预分频*/
    uint32_t NB_BRP;
    /*数据位速率同步段长度*/
    uint32_t DB_SJW;
    /*数据位速率时间段1*/
    uint32_t DB_TS1;
    /*数据位速率时间段2*/
    uint32_t DB_TS2;
    /*数据位速率波特率预分频*/
    uint32_t DB_BRP;
      
    /*通信时钟源选择*/
    uint32_t clockSource;
    /*RAM时钟源选择*/
    uint32_t clockSourceRAM;
    
    /*接收和发送Buffer配置*/
    FL_CANFD_RxMB_CfgTypeDef   rxmbCfg;
    FL_CANFD_RxFIFO_CfgTypeDef rxfifoCfg[2];
    FL_CANFD_CommonFIFO_CfgTypeDef commonfifoCfg;
    FL_CANFD_TxQueue_CfgTypeDef  txqueueCfg;    
    FL_CANFD_TxHistoryList_CfgTypeDef txHistoryCfg;
    
    /*接收滤波器模式配置*/
	uint32_t filterPNMDC;	//C0CTR
	uint32_t filterRPNMD;	//C0CFG
    /*AFL接收滤波器规则数目*/
    uint32_t acceptanceFilterRuleNum;
    FL_CANFD_AcceptanceFilter_CfgTypeDef acceptanceFilterCfg[32];
	/*PFL接收滤波器规则数目*/
	uint32_t pflFilterRuleNum;
    FL_CANFD_PFL_CfgTypeDef pflFilterCfg[2];
	
    /*特殊参数配置*/
    /*发送优先级选择*/
    uint32_t txPriority;
    /*ESI配置*/
    uint32_t esiCfg;
    /*发送延迟补偿偏置*/
    uint32_t tdco;
    /*发送延迟补偿配置*/
    uint32_t tdcoCfg;    
    /*发送延迟补偿使能*/
    FL_FunState tdcoEnable;
    
    /*RES位协议异常检测使能 */
    FL_FunState respedEnable;
    /*DLC检查使能*/
    FL_FunState dlcCheckEnable;
    /*DLC替换使能 */
    FL_FunState dlcReplacementEnable;
    /*消息过载拒接接收使能*/
    FL_FunState messageIsRejected;
} FL_CANFD_InitTypeDef;
    
/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup CANFD_FL_Exported_Constants CANFD Exported Constants
  * @{
  */

#define    CANFD_CFDC0NCFG_NTSEG2_Pos                             (25U)
#define    CANFD_CFDC0NCFG_NTSEG2_Msk                             (0x7fU << CANFD_CFDC0NCFG_NTSEG2_Pos)
#define    CANFD_CFDC0NCFG_NTSEG2                                 CANFD_CFDC0NCFG_NTSEG2_Msk

#define    CANFD_CFDC0NCFG_NTSEG1_Pos                             (17U)
#define    CANFD_CFDC0NCFG_NTSEG1_Msk                             (0xffU << CANFD_CFDC0NCFG_NTSEG1_Pos)
#define    CANFD_CFDC0NCFG_NTSEG1                                 CANFD_CFDC0NCFG_NTSEG1_Msk

#define    CANFD_CFDC0NCFG_NSJW_Pos                               (10U)
#define    CANFD_CFDC0NCFG_NSJW_Msk                               (0x7fU << CANFD_CFDC0NCFG_NSJW_Pos)
#define    CANFD_CFDC0NCFG_NSJW                                   CANFD_CFDC0NCFG_NSJW_Msk

#define    CANFD_CFDC0NCFG_NBRP_Pos                               (0U)
#define    CANFD_CFDC0NCFG_NBRP_Msk                               (0x3ffU << CANFD_CFDC0NCFG_NBRP_Pos)
#define    CANFD_CFDC0NCFG_NBRP                                   CANFD_CFDC0NCFG_NBRP_Msk

#define    CANFD_CFDC0CTR_ROM_Pos                                 (31U)
#define    CANFD_CFDC0CTR_ROM_Msk                                 (0x1U << CANFD_CFDC0CTR_ROM_Pos)
#define    CANFD_CFDC0CTR_ROM                                     CANFD_CFDC0CTR_ROM_Msk

#define    CANFD_CFDC0CTR_BFT_Pos                                 (30U)
#define    CANFD_CFDC0CTR_BFT_Msk                                 (0x1U << CANFD_CFDC0CTR_BFT_Pos)
#define    CANFD_CFDC0CTR_BFT                                     CANFD_CFDC0CTR_BFT_Msk

#define    CANFD_CFDC0CTR_CTMS_Pos                                (25U)
#define    CANFD_CFDC0CTR_CTMS_Msk                                (0x3U << CANFD_CFDC0CTR_CTMS_Pos)
#define    CANFD_CFDC0CTR_CTMS                                    CANFD_CFDC0CTR_CTMS_Msk

#define    CANFD_CFDC0CTR_CTME_Pos                                (24U)
#define    CANFD_CFDC0CTR_CTME_Msk                                (0x1U << CANFD_CFDC0CTR_CTME_Pos)
#define    CANFD_CFDC0CTR_CTME                                    CANFD_CFDC0CTR_CTME_Msk

#define    CANFD_CFDC0CTR_ERRD_Pos                                (23U)
#define    CANFD_CFDC0CTR_ERRD_Msk                                (0x1U << CANFD_CFDC0CTR_ERRD_Pos)
#define    CANFD_CFDC0CTR_ERRD                                    CANFD_CFDC0CTR_ERRD_Msk

#define    CANFD_CFDC0CTR_BOM_Pos                                 (21U)
#define    CANFD_CFDC0CTR_BOM_Msk                                 (0x3U << CANFD_CFDC0CTR_BOM_Pos)
#define    CANFD_CFDC0CTR_BOM                                     CANFD_CFDC0CTR_BOM_Msk

#define    CANFD_CFDC0CTR_TDCVFIE_Pos                             (19U)
#define    CANFD_CFDC0CTR_TDCVFIE_Msk                             (0x1U << CANFD_CFDC0CTR_TDCVFIE_Pos)
#define    CANFD_CFDC0CTR_TDCVFIE                                 CANFD_CFDC0CTR_TDCVFIE_Msk

#define    CANFD_CFDC0CTR_SOCOIE_Pos                              (18U)
#define    CANFD_CFDC0CTR_SOCOIE_Msk                              (0x1U << CANFD_CFDC0CTR_SOCOIE_Pos)
#define    CANFD_CFDC0CTR_SOCOIE                                  CANFD_CFDC0CTR_SOCOIE_Msk

