Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_canfd.h
#define    CANFD_CFDGAFLP0r_GAFLPTR_Pos                           (16U)
#define    CANFD_CFDGAFLP0r_GAFLPTR_Msk                           (0xffffU << CANFD_CFDGAFLP0r_GAFLPTR_Pos)
#define    CANFD_CFDGAFLP0r_GAFLPTR                               CANFD_CFDGAFLP0r_GAFLPTR_Msk

#define    CANFD_CFDGAFLP0r_GAFLRMV_Pos                           (15U)
#define    CANFD_CFDGAFLP0r_GAFLRMV_Msk                           (0x1U << CANFD_CFDGAFLP0r_GAFLRMV_Pos)
#define    CANFD_CFDGAFLP0r_GAFLRMV                               CANFD_CFDGAFLP0r_GAFLRMV_Msk

#define    CANFD_CFDGAFLP0r_GAFLRMDP_Pos                          (8U)
#define    CANFD_CFDGAFLP0r_GAFLRMDP_Msk                          (0x1fU << CANFD_CFDGAFLP0r_GAFLRMDP_Pos)
#define    CANFD_CFDGAFLP0r_GAFLRMDP                              CANFD_CFDGAFLP0r_GAFLRMDP_Msk

#define    CANFD_CFDGAFLP0r_GAFLIFL0_Pos                          (7U)
#define    CANFD_CFDGAFLP0r_GAFLIFL0_Msk                          (0x1U << CANFD_CFDGAFLP0r_GAFLIFL0_Pos)
#define    CANFD_CFDGAFLP0r_GAFLIFL0                              CANFD_CFDGAFLP0r_GAFLIFL0_Msk

#define    CANFD_CFDGAFLP0r_GAFLDLC_Pos                           (0U)
#define    CANFD_CFDGAFLP0r_GAFLDLC_Msk                           (0xfU << CANFD_CFDGAFLP0r_GAFLDLC_Pos)
#define    CANFD_CFDGAFLP0r_GAFLDLC                               CANFD_CFDGAFLP0r_GAFLDLC_Msk

#define    CANFD_CFDGAFLP1r_GAFLFDPH_Pos                          (8U)
#define    CANFD_CFDGAFLP1r_GAFLFDPH_Msk                          (0x1U << CANFD_CFDGAFLP1r_GAFLFDPH_Pos)
#define    CANFD_CFDGAFLP1r_GAFLFDPH                              CANFD_CFDGAFLP1r_GAFLFDPH_Msk

#define    CANFD_CFDGAFLP1r_GAFLFDPL_Pos                          (0U)
#define    CANFD_CFDGAFLP1r_GAFLFDPL_Msk                          (0x1U << CANFD_CFDGAFLP1r_GAFLFDPL_Pos)
#define    CANFD_CFDGAFLP1r_GAFLFDPL                              CANFD_CFDGAFLP1r_GAFLFDPL_Msk

#define    CANFD_CFDRMNB_RMPLS_Pos                                (8U)
#define    CANFD_CFDRMNB_RMPLS_Msk                                (0x7U << CANFD_CFDRMNB_RMPLS_Pos)
#define    CANFD_CFDRMNB_RMPLS                                    CANFD_CFDRMNB_RMPLS_Msk

#define    CANFD_CFDRMNB_NRXMB_Pos                                (0U)
#define    CANFD_CFDRMNB_NRXMB_Msk                                (0x3fU << CANFD_CFDRMNB_NRXMB_Pos)
#define    CANFD_CFDRMNB_NRXMB                                    CANFD_CFDRMNB_NRXMB_Msk

#define    CANFD_CFDRMND_RMNSu_Pos                                (0U)
#define    CANFD_CFDRMND_RMNSu_Msk                                (0x1U << CANFD_CFDRMND_RMNSu_Pos)
#define    CANFD_CFDRMND_RMNSu                                    CANFD_CFDRMND_RMNSu_Msk

#define    CANFD_CFDRFCCa_RFIGCV_Pos                              (13U)
#define    CANFD_CFDRFCCa_RFIGCV_Msk                              (0x7U << CANFD_CFDRFCCa_RFIGCV_Pos)
#define    CANFD_CFDRFCCa_RFIGCV                                  CANFD_CFDRFCCa_RFIGCV_Msk

#define    CANFD_CFDRFCCa_RFIM_Pos                                (12U)
#define    CANFD_CFDRFCCa_RFIM_Msk                                (0x1U << CANFD_CFDRFCCa_RFIM_Pos)
#define    CANFD_CFDRFCCa_RFIM                                    CANFD_CFDRFCCa_RFIM_Msk

#define    CANFD_CFDRFCCa_RFDC_Pos                                (8U)
#define    CANFD_CFDRFCCa_RFDC_Msk                                (0x7U << CANFD_CFDRFCCa_RFDC_Pos)
#define    CANFD_CFDRFCCa_RFDC                                    CANFD_CFDRFCCa_RFDC_Msk

#define    CANFD_CFDRFCCa_RFPLS_Pos                               (4U)
#define    CANFD_CFDRFCCa_RFPLS_Msk                               (0x7U << CANFD_CFDRFCCa_RFPLS_Pos)
#define    CANFD_CFDRFCCa_RFPLS                                   CANFD_CFDRFCCa_RFPLS_Msk

#define    CANFD_CFDRFCCa_RFIE_Pos                                (1U)
#define    CANFD_CFDRFCCa_RFIE_Msk                                (0x1U << CANFD_CFDRFCCa_RFIE_Pos)
#define    CANFD_CFDRFCCa_RFIE                                    CANFD_CFDRFCCa_RFIE_Msk

#define    CANFD_CFDRFCCa_RFE_Pos                                 (0U)
#define    CANFD_CFDRFCCa_RFE_Msk                                 (0x1U << CANFD_CFDRFCCa_RFE_Pos)
#define    CANFD_CFDRFCCa_RFE                                     CANFD_CFDRFCCa_RFE_Msk

#define    CANFD_CFDRFSTSa_RFMC_Pos                               (8U)
#define    CANFD_CFDRFSTSa_RFMC_Msk                               (0x3fU << CANFD_CFDRFSTSa_RFMC_Pos)
#define    CANFD_CFDRFSTSa_RFMC                                   CANFD_CFDRFSTSa_RFMC_Msk

#define    CANFD_CFDRFSTSa_RFIF_Pos                               (3U)
#define    CANFD_CFDRFSTSa_RFIF_Msk                               (0x1U << CANFD_CFDRFSTSa_RFIF_Pos)
#define    CANFD_CFDRFSTSa_RFIF                                   CANFD_CFDRFSTSa_RFIF_Msk

#define    CANFD_CFDRFSTSa_RFMLT_Pos                              (2U)
#define    CANFD_CFDRFSTSa_RFMLT_Msk                              (0x1U << CANFD_CFDRFSTSa_RFMLT_Pos)
#define    CANFD_CFDRFSTSa_RFMLT                                  CANFD_CFDRFSTSa_RFMLT_Msk

#define    CANFD_CFDRFSTSa_RFFLL_Pos                              (1U)
#define    CANFD_CFDRFSTSa_RFFLL_Msk                              (0x1U << CANFD_CFDRFSTSa_RFFLL_Pos)
#define    CANFD_CFDRFSTSa_RFFLL                                  CANFD_CFDRFSTSa_RFFLL_Msk

#define    CANFD_CFDRFSTSa_RFEMP_Pos                              (0U)
#define    CANFD_CFDRFSTSa_RFEMP_Msk                              (0x1U << CANFD_CFDRFSTSa_RFEMP_Pos)
#define    CANFD_CFDRFSTSa_RFEMP                                  CANFD_CFDRFSTSa_RFEMP_Msk

#define    CANFD_CFDRFPCTRa_RFPC_Pos                              (0U)
#define    CANFD_CFDRFPCTRa_RFPC_Msk                              (0xffU << CANFD_CFDRFPCTRa_RFPC_Pos)
#define    CANFD_CFDRFPCTRa_RFPC                                  CANFD_CFDRFPCTRa_RFPC_Msk

#define    CANFD_CFDCFCC_CFITT_Pos                                (24U)
#define    CANFD_CFDCFCC_CFITT_Msk                                (0xffU << CANFD_CFDCFCC_CFITT_Pos)
#define    CANFD_CFDCFCC_CFITT                                    CANFD_CFDCFCC_CFITT_Msk

#define    CANFD_CFDCFCC_CFDC_Pos                                 (21U)
#define    CANFD_CFDCFCC_CFDC_Msk                                 (0x7U << CANFD_CFDCFCC_CFDC_Pos)
#define    CANFD_CFDCFCC_CFDC                                     CANFD_CFDCFCC_CFDC_Msk

