Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_canfd.h
#define    CANFD_CFDTMSTSj_TMTRM_Pos                              (3U)
#define    CANFD_CFDTMSTSj_TMTRM_Msk                              (0x1U << CANFD_CFDTMSTSj_TMTRM_Pos)
#define    CANFD_CFDTMSTSj_TMTRM                                  CANFD_CFDTMSTSj_TMTRM_Msk

#define    CANFD_CFDTMSTSj_TMTRF_Pos                              (1U)
#define    CANFD_CFDTMSTSj_TMTRF_Msk                              (0x3U << CANFD_CFDTMSTSj_TMTRF_Pos)
#define    CANFD_CFDTMSTSj_TMTRF                                  CANFD_CFDTMSTSj_TMTRF_Msk

#define    CANFD_CFDTMSTSj_TMTSTS_Pos                             (0U)
#define    CANFD_CFDTMSTSj_TMTSTS_Msk                             (0x1U << CANFD_CFDTMSTSj_TMTSTS_Pos)
#define    CANFD_CFDTMSTSj_TMTSTS                                 CANFD_CFDTMSTSj_TMTSTS_Msk

#define    CANFD_CFDTMTRSTS_CFDTMTRSTSg_Pos                       (0U)
#define    CANFD_CFDTMTRSTS_CFDTMTRSTSg_Msk                       (0x1U << CANFD_CFDTMTRSTS_CFDTMTRSTSg_Pos)
#define    CANFD_CFDTMTRSTS_CFDTMTRSTSg                           CANFD_CFDTMTRSTS_CFDTMTRSTSg_Msk

#define    CANFD_CFDTMTARSTS_CFDTMTARSTSg_Pos                     (0U)
#define    CANFD_CFDTMTARSTS_CFDTMTARSTSg_Msk                     (0x1U << CANFD_CFDTMTARSTS_CFDTMTARSTSg_Pos)
#define    CANFD_CFDTMTARSTS_CFDTMTARSTSg                         CANFD_CFDTMTARSTS_CFDTMTARSTSg_Msk

#define    CANFD_CFDTMTCSTS_CFDTMTCSTSg_Pos                       (0U)
#define    CANFD_CFDTMTCSTS_CFDTMTCSTSg_Msk                       (0x1U << CANFD_CFDTMTCSTS_CFDTMTCSTSg_Pos)
#define    CANFD_CFDTMTCSTS_CFDTMTCSTSg                           CANFD_CFDTMTCSTS_CFDTMTCSTSg_Msk

#define    CANFD_CFDTMTASTS_CFDTMTASTSg_Pos                       (0U)
#define    CANFD_CFDTMTASTS_CFDTMTASTSg_Msk                       (0x1U << CANFD_CFDTMTASTS_CFDTMTASTSg_Pos)
#define    CANFD_CFDTMTASTS_CFDTMTASTSg                           CANFD_CFDTMTASTS_CFDTMTASTSg_Msk

#define    CANFD_CFDTMIEC_TMIEg_Pos                               (0U)
#define    CANFD_CFDTMIEC_TMIEg_Msk                               (0x1U << CANFD_CFDTMIEC_TMIEg_Pos)
#define    CANFD_CFDTMIEC_TMIEg                                   CANFD_CFDTMIEC_TMIEg_Msk

#define    CANFD_CFDTXQCC_TXQDC_Pos                               (8U)
#define    CANFD_CFDTXQCC_TXQDC_Msk                               (0x3U << CANFD_CFDTXQCC_TXQDC_Pos)
#define    CANFD_CFDTXQCC_TXQDC                                   CANFD_CFDTXQCC_TXQDC_Msk

#define    CANFD_CFDTXQCC_TXQIM_Pos                               (7U)
#define    CANFD_CFDTXQCC_TXQIM_Msk                               (0x1U << CANFD_CFDTXQCC_TXQIM_Pos)
#define    CANFD_CFDTXQCC_TXQIM                                   CANFD_CFDTXQCC_TXQIM_Msk

#define    CANFD_CFDTXQCC_TXQTXIE_Pos                             (5U)
#define    CANFD_CFDTXQCC_TXQTXIE_Msk                             (0x1U << CANFD_CFDTXQCC_TXQTXIE_Pos)
#define    CANFD_CFDTXQCC_TXQTXIE                                 CANFD_CFDTXQCC_TXQTXIE_Msk

#define    CANFD_CFDTXQCC_TXQE_Pos                                (0U)
#define    CANFD_CFDTXQCC_TXQE_Msk                                (0x1U << CANFD_CFDTXQCC_TXQE_Pos)
#define    CANFD_CFDTXQCC_TXQE                                    CANFD_CFDTXQCC_TXQE_Msk

#define    CANFD_CFDTXQSTS_TXQMC_Pos                              (8U)
#define    CANFD_CFDTXQSTS_TXQMC_Msk                              (0x7U << CANFD_CFDTXQSTS_TXQMC_Pos)
#define    CANFD_CFDTXQSTS_TXQMC                                  CANFD_CFDTXQSTS_TXQMC_Msk

#define    CANFD_CFDTXQSTS_TXQTXIF_Pos                            (2U)
#define    CANFD_CFDTXQSTS_TXQTXIF_Msk                            (0x1U << CANFD_CFDTXQSTS_TXQTXIF_Pos)
#define    CANFD_CFDTXQSTS_TXQTXIF                                CANFD_CFDTXQSTS_TXQTXIF_Msk

#define    CANFD_CFDTXQSTS_TXQFLL_Pos                             (1U)
#define    CANFD_CFDTXQSTS_TXQFLL_Msk                             (0x1U << CANFD_CFDTXQSTS_TXQFLL_Pos)
#define    CANFD_CFDTXQSTS_TXQFLL                                 CANFD_CFDTXQSTS_TXQFLL_Msk

#define    CANFD_CFDTXQSTS_TXQEMP_Pos                             (0U)
#define    CANFD_CFDTXQSTS_TXQEMP_Msk                             (0x1U << CANFD_CFDTXQSTS_TXQEMP_Pos)
#define    CANFD_CFDTXQSTS_TXQEMP                                 CANFD_CFDTXQSTS_TXQEMP_Msk

#define    CANFD_CFDTXQPCTR_TXQPC_Pos                             (0U)
#define    CANFD_CFDTXQPCTR_TXQPC_Msk                             (0xffU << CANFD_CFDTXQPCTR_TXQPC_Pos)
#define    CANFD_CFDTXQPCTR_TXQPC                                 CANFD_CFDTXQPCTR_TXQPC_Msk

#define    CANFD_CFDTHLCC_THLDTE_Pos                              (10U)
#define    CANFD_CFDTHLCC_THLDTE_Msk                              (0x1U << CANFD_CFDTHLCC_THLDTE_Pos)
#define    CANFD_CFDTHLCC_THLDTE                                  CANFD_CFDTHLCC_THLDTE_Msk

#define    CANFD_CFDTHLCC_THLIM_Pos                               (9U)
#define    CANFD_CFDTHLCC_THLIM_Msk                               (0x1U << CANFD_CFDTHLCC_THLIM_Pos)
#define    CANFD_CFDTHLCC_THLIM                                   CANFD_CFDTHLCC_THLIM_Msk

#define    CANFD_CFDTHLCC_THLIE_Pos                               (8U)
#define    CANFD_CFDTHLCC_THLIE_Msk                               (0x1U << CANFD_CFDTHLCC_THLIE_Pos)
#define    CANFD_CFDTHLCC_THLIE                                   CANFD_CFDTHLCC_THLIE_Msk

#define    CANFD_CFDTHLCC_THLE_Pos                                (0U)
#define    CANFD_CFDTHLCC_THLE_Msk                                (0x1U << CANFD_CFDTHLCC_THLE_Pos)
#define    CANFD_CFDTHLCC_THLE                                    CANFD_CFDTHLCC_THLE_Msk

#define    CANFD_CFDTHLSTS_THLMC_Pos                              (8U)
#define    CANFD_CFDTHLSTS_THLMC_Msk                              (0xfU << CANFD_CFDTHLSTS_THLMC_Pos)
#define    CANFD_CFDTHLSTS_THLMC                                  CANFD_CFDTHLSTS_THLMC_Msk

#define    CANFD_CFDTHLSTS_THLIF_Pos                              (3U)
#define    CANFD_CFDTHLSTS_THLIF_Msk                              (0x1U << CANFD_CFDTHLSTS_THLIF_Pos)
#define    CANFD_CFDTHLSTS_THLIF                                  CANFD_CFDTHLSTS_THLIF_Msk

#define    CANFD_CFDTHLSTS_THLELT_Pos                             (2U)
#define    CANFD_CFDTHLSTS_THLELT_Msk                             (0x1U << CANFD_CFDTHLSTS_THLELT_Pos)
#define    CANFD_CFDTHLSTS_THLELT                                 CANFD_CFDTHLSTS_THLELT_Msk

#define    CANFD_CFDTHLSTS_THLFLL_Pos                             (1U)
#define    CANFD_CFDTHLSTS_THLFLL_Msk                             (0x1U << CANFD_CFDTHLSTS_THLFLL_Pos)
#define    CANFD_CFDTHLSTS_THLFLL                                 CANFD_CFDTHLSTS_THLFLL_Msk

#define    CANFD_CFDTHLSTS_THLEMP_Pos                             (0U)
#define    CANFD_CFDTHLSTS_THLEMP_Msk                             (0x1U << CANFD_CFDTHLSTS_THLEMP_Pos)
#define    CANFD_CFDTHLSTS_THLEMP                                 CANFD_CFDTHLSTS_THLEMP_Msk

#define    CANFD_CFDTHLACC0_TMTS_Pos                              (16U)
#define    CANFD_CFDTHLACC0_TMTS_Msk                              (0xffffU << CANFD_CFDTHLACC0_TMTS_Pos)
#define    CANFD_CFDTHLACC0_TMTS                                  CANFD_CFDTHLACC0_TMTS_Msk

#define    CANFD_CFDTHLACC0_BN_Pos                                (3U)
#define    CANFD_CFDTHLACC0_BN_Msk                                (0x3U << CANFD_CFDTHLACC0_BN_Pos)
#define    CANFD_CFDTHLACC0_BN                                    CANFD_CFDTHLACC0_BN_Msk

#define    CANFD_CFDTHLACC0_BT_Pos                                (0U)
#define    CANFD_CFDTHLACC0_BT_Msk                                (0x7U << CANFD_CFDTHLACC0_BT_Pos)
#define    CANFD_CFDTHLACC0_BT                                    CANFD_CFDTHLACC0_BT_Msk

#define    CANFD_CFDTHLACC1_TIFL_Pos                              (16U)
#define    CANFD_CFDTHLACC1_TIFL_Msk                              (0x3U << CANFD_CFDTHLACC1_TIFL_Pos)
#define    CANFD_CFDTHLACC1_TIFL                                  CANFD_CFDTHLACC1_TIFL_Msk

#define    CANFD_CFDTHLACC1_TID_Pos                               (0U)
#define    CANFD_CFDTHLACC1_TID_Msk                               (0xffffU << CANFD_CFDTHLACC1_TID_Pos)
#define    CANFD_CFDTHLACC1_TID                                   CANFD_CFDTHLACC1_TID_Msk

#define    CANFD_CFDTHLPCTR_THLPC_Pos                             (0U)
#define    CANFD_CFDTHLPCTR_THLPC_Msk                             (0xffU << CANFD_CFDTHLPCTR_THLPC_Pos)
#define    CANFD_CFDTHLPCTR_THLPC                                 CANFD_CFDTHLPCTR_THLPC_Msk

#define    CANFD_CFDGRSTC_KEY_Pos                                 (8U)
#define    CANFD_CFDGRSTC_KEY_Msk                                 (0xffU << CANFD_CFDGRSTC_KEY_Pos)
#define    CANFD_CFDGRSTC_KEY                                     CANFD_CFDGRSTC_KEY_Msk

#define    CANFD_CFDGRSTC_SRST_Pos                                (0U)
#define    CANFD_CFDGRSTC_SRST_Msk                                (0x1U << CANFD_CFDGRSTC_SRST_Pos)
#define    CANFD_CFDGRSTC_SRST                                    CANFD_CFDGRSTC_SRST_Msk

#define    CANFD_CFDGTSTCFG_RTMPS_Pos                             (16U)
#define    CANFD_CFDGTSTCFG_RTMPS_Msk                             (0xfU << CANFD_CFDGTSTCFG_RTMPS_Pos)
#define    CANFD_CFDGTSTCFG_RTMPS                                 CANFD_CFDGTSTCFG_RTMPS_Msk

#define    CANFD_CFDGTSTCTR_RTME_Pos                              (2U)
#define    CANFD_CFDGTSTCTR_RTME_Msk                              (0x1U << CANFD_CFDGTSTCTR_RTME_Pos)
#define    CANFD_CFDGTSTCTR_RTME                                  CANFD_CFDGTSTCTR_RTME_Msk

