Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_canfd.h
#define    CANFD_CFDTMFDCTR_TMFDF_Pos                             (2U)
#define    CANFD_CFDTMFDCTR_TMFDF_Msk                             (0x1U << CANFD_CFDTMFDCTR_TMFDF_Pos)
#define    CANFD_CFDTMFDCTR_TMFDF                                 CANFD_CFDTMFDCTR_TMFDF_Msk

#define    CANFD_CFDTMFDCTR_TMBRS_Pos                             (1U)
#define    CANFD_CFDTMFDCTR_TMBRS_Msk                             (0x1U << CANFD_CFDTMFDCTR_TMBRS_Pos)
#define    CANFD_CFDTMFDCTR_TMBRS                                 CANFD_CFDTMFDCTR_TMBRS_Msk

#define    CANFD_CFDTMFDCTR_TMESI_Pos                             (0U)
#define    CANFD_CFDTMFDCTR_TMESI_Msk                             (0x1U << CANFD_CFDTMFDCTR_TMESI_Pos)
#define    CANFD_CFDTMFDCTR_TMESI                                 CANFD_CFDTMFDCTR_TMESI_Msk

#define    CANFD_CFDTMDFp_TMDB_Pos                                (0U)
#define    CANFD_CFDTMDFp_TMDB_Msk                                (0xffffffffU << CANFD_CFDTMDFp_TMDB_Pos)
#define    CANFD_CFDTMDFp_TMDB                                    CANFD_CFDTMDFp_TMDB_Msk



#define    FL_CANFD_AFL_FILTER0                                   0x0U
#define    FL_CANFD_AFL_FILTER1                                   0x1U
#define    FL_CANFD_AFL_FILTER2                                   0x2U
#define    FL_CANFD_AFL_FILTER3                                   0x3U
#define    FL_CANFD_AFL_FILTER4                                   0x4U
#define    FL_CANFD_AFL_FILTER5                                   0x5U
#define    FL_CANFD_AFL_FILTER6                                   0x6U
#define    FL_CANFD_AFL_FILTER7                                   0x7U
#define    FL_CANFD_AFL_FILTER8                                   0x8U
#define    FL_CANFD_AFL_FILTER9                                   0x9U
#define    FL_CANFD_AFL_FILTER10                                  0xAU
#define    FL_CANFD_AFL_FILTER11                                  0xBU
#define    FL_CANFD_AFL_FILTER12                                  0xCU
#define    FL_CANFD_AFL_FILTER13                                  0xDU
#define    FL_CANFD_AFL_FILTER14                                  0xEU
#define    FL_CANFD_AFL_FILTER15                                  0xFU
#define    FL_CANFD_AFL_FILTER_MAX                                0x10U
#define    FL_CANFD_RXFIFO0                                       0x0U
#define    FL_CANFD_RXFIFO1                                       0x1U
#define    FL_CANFD_RXFIFO_MAX                                    0x2U
#define    FL_CANFD_RXMB0                                         0x0U
#define    FL_CANFD_RXMB1                                         0x1U
#define    FL_CANFD_RXMB2                                         0x2U
#define    FL_CANFD_RXMB3                                         0x3U
#define    FL_CANFD_RXMB4                                         0x4U
#define    FL_CANFD_RXMB5                                         0x5U
#define    FL_CANFD_RXMB6                                         0x6U
#define    FL_CANFD_RXMB7                                         0x7U
#define    FL_CANFD_RXMB8                                         0x8U
#define    FL_CANFD_RXMB9                                         0x9U
#define    FL_CANFD_RXMB10                                        0xAU
#define    FL_CANFD_RXMB11                                        0xBU
#define    FL_CANFD_RXMB12                                        0xCU
#define    FL_CANFD_RXMB13                                        0xDU
#define    FL_CANFD_RXMB14                                        0xEU
#define    FL_CANFD_RXMB15                                        0xFU
#define    FL_CANFD_RXMB16                                        0x10U
#define    FL_CANFD_RXMB17                                        0x11U
#define    FL_CANFD_RXMB18                                        0x12U
#define    FL_CANFD_RXMB19                                        0x13U
#define    FL_CANFD_RXMB20                                        0x14U
#define    FL_CANFD_RXMB21                                        0x15U
#define    FL_CANFD_RXMB22                                        0x16U
#define    FL_CANFD_RXMB23                                        0x17U
#define    FL_CANFD_RXMB24                                        0x18U
#define    FL_CANFD_RXMB25                                        0x19U
#define    FL_CANFD_RXMB26                                        0x1AU
#define    FL_CANFD_RXMB27                                        0x1BU
#define    FL_CANFD_RXMB28                                        0x1CU
#define    FL_CANFD_RXMB29                                        0x1DU
#define    FL_CANFD_RXMB30                                        0x1EU
#define    FL_CANFD_RXMB31                                        0x1FU
#define    FL_CANFD_RXMB_MAX                                      0x20U
#define    FL_CANFD_TXMB0                                         0x0U
#define    FL_CANFD_TXMB1                                         0x1U
#define    FL_CANFD_TXMB2                                         0x2U
#define    FL_CANFD_TXMB3                                         0x3U
#define    FL_CANFD_TXMB_MAX                                      0x4U
#define    FL_CANFD_PFL_FILTER0                                   0x0U
#define    FL_CANFD_PFL_FILTER1                                   0x1U
#define    FL_CANFD_PFL_FILTER_MAX                                0x2U
#define    FL_CANFD_DATA0                                         0x0U
#define    FL_CANFD_DATA1                                         0x1U
#define    FL_CANFD_DATA2                                         0x2U
#define    FL_CANFD_DATA3                                         0x3U
#define    FL_CANFD_DATA4                                         0x4U
#define    FL_CANFD_DATA5                                         0x5U
#define    FL_CANFD_DATA6                                         0x6U
#define    FL_CANFD_DATA7                                         0x7U
#define    FL_CANFD_DATA8                                         0x8U
#define    FL_CANFD_DATA9                                         0x9U
#define    FL_CANFD_DATA10                                        0xAU
#define    FL_CANFD_DATA11                                        0xBU
#define    FL_CANFD_DATA12                                        0xCU
#define    FL_CANFD_DATA13                                        0xDU
#define    FL_CANFD_DATA14                                        0xEU
#define    FL_CANFD_DATA15                                        0xFU
#define    FL_CANFD_DATA_MAX                                      0x10U



#define    FL_CANFD_CHANNEL_TEST_MODE_BASIC                       (0x0U << CANFD_CFDC0CTR_CTMS_Pos)
#define    FL_CANFD_CHANNEL_TEST_MODE_LISTEN                      (0x1U << CANFD_CFDC0CTR_CTMS_Pos)
#define    FL_CANFD_CHANNEL_TEST_MODE_SELFTEST0                   (0x2U << CANFD_CFDC0CTR_CTMS_Pos)
#define    FL_CANFD_CHANNEL_TEST_MODE_SELFTEST1                   (0x3U << CANFD_CFDC0CTR_CTMS_Pos)


#define    FL_CANFD_CHANNEL_ERROR_DISPLAY_TYPE_FIRST_GROUP        (0x0U << CANFD_CFDC0CTR_ERRD_Pos)
#define    FL_CANFD_CHANNEL_ERROR_DISPLAY_TYPE_CUMULATIVE         (0x1U << CANFD_CFDC0CTR_ERRD_Pos)


#define    FL_CANFD_CHANNEL_BUSOFF_MODE_NORMAL                    (0x0U << CANFD_CFDC0CTR_BOM_Pos)
#define    FL_CANFD_CHANNEL_BUSOFF_MODE_HALT_AT_BUSOFF_SATRT      (0x1U << CANFD_CFDC0CTR_BOM_Pos)
#define    FL_CANFD_CHANNEL_BUSOFF_MODE_HALT_AT_BUSOFF_END        (0x2U << CANFD_CFDC0CTR_BOM_Pos)
#define    FL_CANFD_CHANNEL_BUSOFF_MODE_HALT_BY_SW                (0x3U << CANFD_CFDC0CTR_BOM_Pos)


#define    FL_CANFD_CHANNEL_MODE_OPERATION                        (0x0U << CANFD_CFDC0CTR_CHMDC_Pos)
#define    FL_CANFD_CHANNEL_MODE_RESET                            (0x1U << CANFD_CFDC0CTR_CHMDC_Pos)
#define    FL_CANFD_CHANNEL_MODE_HALT                             (0x2U << CANFD_CFDC0CTR_CHMDC_Pos)
#define    FL_CANFD_CHANNEL_MODE_KEEP_CURRENT                     (0x3U << CANFD_CFDC0CTR_CHMDC_Pos)


#define    FL_CANFD_RETURN_PNF_MODE_AF                            (0x0U << CANFD_CFDC0FDCFG_RPNMD_Pos)
#define    FL_CANFD_RETURN_PNF_MODE_PNFID_AF                      (0x1U << CANFD_CFDC0FDCFG_RPNMD_Pos)
#define    FL_CANFD_RETURN_PNF_MODE_PNF_AF                        (0x2U << CANFD_CFDC0FDCFG_RPNMD_Pos)
#define    FL_CANFD_RETURN_PNF_MODE_PNF                           (0x3U << CANFD_CFDC0FDCFG_RPNMD_Pos)


#define    FL_CANFD_ESI_CONFIGURATION_NODE_STATE                  (0x0U << CANFD_CFDC0FDCFG_ESIC_Pos)
#define    FL_CANFD_ESI_CONFIGURATION_SOFTWARE                    (0x1U << CANFD_CFDC0FDCFG_ESIC_Pos)


#define    FL_CANFD_TDCO_CONFIGURATION_MEASURED_WITH_OFFSET       (0x0U << CANFD_CFDC0FDCFG_TDCOC_Pos)
#define    FL_CANFD_TDCO_CONFIGURATION_OFFSET                     (0x1U << CANFD_CFDC0FDCFG_TDCOC_Pos)


