Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_canfd.h
/**
  * @brief    Get Global RX Message Buffer Pointer Field 
  * @rmtoll   CFDRMFDSTS    RMPTR    FL_CANFD_Global_ReadRxMBPointer
  * @param    CANFDx CANFD instance
  * @param    rxmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXMB0
  *           @arg @ref FL_CANFD_RXMB1
  *           @arg @ref FL_CANFD_RXMB2
  *           @arg @ref FL_CANFD_RXMB3
  *           @arg @ref FL_CANFD_RXMB4
  *           @arg @ref FL_CANFD_RXMB5
  *           @arg @ref FL_CANFD_RXMB6
  *           @arg @ref FL_CANFD_RXMB7
  *           @arg @ref FL_CANFD_RXMB8
  *           @arg @ref FL_CANFD_RXMB9
  *           @arg @ref FL_CANFD_RXMB10
  *           @arg @ref FL_CANFD_RXMB11
  *           @arg @ref FL_CANFD_RXMB12
  *           @arg @ref FL_CANFD_RXMB13
  *           @arg @ref FL_CANFD_RXMB14
  *           @arg @ref FL_CANFD_RXMB15
  *           @arg @ref FL_CANFD_RXMB16
  *           @arg @ref FL_CANFD_RXMB17
  *           @arg @ref FL_CANFD_RXMB18
  *           @arg @ref FL_CANFD_RXMB19
  *           @arg @ref FL_CANFD_RXMB20
  *           @arg @ref FL_CANFD_RXMB21
  *           @arg @ref FL_CANFD_RXMB22
  *           @arg @ref FL_CANFD_RXMB23
  *           @arg @ref FL_CANFD_RXMB24
  *           @arg @ref FL_CANFD_RXMB25
  *           @arg @ref FL_CANFD_RXMB26
  *           @arg @ref FL_CANFD_RXMB27
  *           @arg @ref FL_CANFD_RXMB28
  *           @arg @ref FL_CANFD_RXMB29
  *           @arg @ref FL_CANFD_RXMB30
  *           @arg @ref FL_CANFD_RXMB31
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadRxMBPointer(CANFD_COMMON_Type* CANFDx, uint32_t rxmbX)
{
    return (uint32_t)(READ_BIT(RM(CANFDx, rxmbX).CFDRMFDSTSb, (0xffffU << 16U)) >> 16U);
}

/**
  * @brief    Get Global RX Message Buffer Information label  Field 
  * @rmtoll   CFDRMFDSTS    RMIFL    FL_CANFD_Global_ReadRxMBInfoLabel
  * @param    CANFDx CANFD instance
  * @param    rxmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXMB0
  *           @arg @ref FL_CANFD_RXMB1
  *           @arg @ref FL_CANFD_RXMB2
  *           @arg @ref FL_CANFD_RXMB3
  *           @arg @ref FL_CANFD_RXMB4
  *           @arg @ref FL_CANFD_RXMB5
  *           @arg @ref FL_CANFD_RXMB6
  *           @arg @ref FL_CANFD_RXMB7
  *           @arg @ref FL_CANFD_RXMB8
  *           @arg @ref FL_CANFD_RXMB9
  *           @arg @ref FL_CANFD_RXMB10
  *           @arg @ref FL_CANFD_RXMB11
  *           @arg @ref FL_CANFD_RXMB12
  *           @arg @ref FL_CANFD_RXMB13
  *           @arg @ref FL_CANFD_RXMB14
  *           @arg @ref FL_CANFD_RXMB15
  *           @arg @ref FL_CANFD_RXMB16
  *           @arg @ref FL_CANFD_RXMB17
  *           @arg @ref FL_CANFD_RXMB18
  *           @arg @ref FL_CANFD_RXMB19
  *           @arg @ref FL_CANFD_RXMB20
  *           @arg @ref FL_CANFD_RXMB21
  *           @arg @ref FL_CANFD_RXMB22
  *           @arg @ref FL_CANFD_RXMB23
  *           @arg @ref FL_CANFD_RXMB24
  *           @arg @ref FL_CANFD_RXMB25
  *           @arg @ref FL_CANFD_RXMB26
  *           @arg @ref FL_CANFD_RXMB27
  *           @arg @ref FL_CANFD_RXMB28
  *           @arg @ref FL_CANFD_RXMB29
  *           @arg @ref FL_CANFD_RXMB30
  *           @arg @ref FL_CANFD_RXMB31
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadRxMBInfoLabel(CANFD_COMMON_Type* CANFDx, uint32_t rxmbX)
{
    return (uint32_t)(READ_BIT(RM(CANFDx, rxmbX).CFDRMFDSTSb, (0x3U << 8U)) >> 8U);
}

/**
  * @brief    Get Global RX Message Buffer CAN FD Format bit
  * @rmtoll   CFDRMFDSTS    RMFDF    FL_CANFD_Global_IsActiveFlag_RxMBFDFormat
  * @param    CANFDx CANFD instance
  * @param    rxmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXMB0
  *           @arg @ref FL_CANFD_RXMB1
  *           @arg @ref FL_CANFD_RXMB2
  *           @arg @ref FL_CANFD_RXMB3
  *           @arg @ref FL_CANFD_RXMB4
  *           @arg @ref FL_CANFD_RXMB5
  *           @arg @ref FL_CANFD_RXMB6
  *           @arg @ref FL_CANFD_RXMB7
  *           @arg @ref FL_CANFD_RXMB8
  *           @arg @ref FL_CANFD_RXMB9
  *           @arg @ref FL_CANFD_RXMB10
  *           @arg @ref FL_CANFD_RXMB11
  *           @arg @ref FL_CANFD_RXMB12
  *           @arg @ref FL_CANFD_RXMB13
  *           @arg @ref FL_CANFD_RXMB14
  *           @arg @ref FL_CANFD_RXMB15
  *           @arg @ref FL_CANFD_RXMB16
  *           @arg @ref FL_CANFD_RXMB17
  *           @arg @ref FL_CANFD_RXMB18
  *           @arg @ref FL_CANFD_RXMB19
  *           @arg @ref FL_CANFD_RXMB20
  *           @arg @ref FL_CANFD_RXMB21
  *           @arg @ref FL_CANFD_RXMB22
  *           @arg @ref FL_CANFD_RXMB23
  *           @arg @ref FL_CANFD_RXMB24
  *           @arg @ref FL_CANFD_RXMB25
  *           @arg @ref FL_CANFD_RXMB26
  *           @arg @ref FL_CANFD_RXMB27
  *           @arg @ref FL_CANFD_RXMB28
  *           @arg @ref FL_CANFD_RXMB29
  *           @arg @ref FL_CANFD_RXMB30
  *           @arg @ref FL_CANFD_RXMB31
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_RxMBFDFormat(CANFD_COMMON_Type* CANFDx, uint32_t rxmbX)
{
    return (uint32_t)(READ_BIT(RM(CANFDx, rxmbX).CFDRMFDSTSb, CANFD_CFDRMFDSTS_RMFDF_Msk) == (CANFD_CFDRMFDSTS_RMFDF_Msk));
}

/**
  * @brief    Get Global RX Message Buffer Bit Rate Switch bit
  * @rmtoll   CFDRMFDSTS    RMBRS    FL_CANFD_Global_IsActiveFlag_RxMBBitRateSwitch
  * @param    CANFDx CANFD instance
  * @param    rxmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXMB0
  *           @arg @ref FL_CANFD_RXMB1
  *           @arg @ref FL_CANFD_RXMB2
  *           @arg @ref FL_CANFD_RXMB3
  *           @arg @ref FL_CANFD_RXMB4
  *           @arg @ref FL_CANFD_RXMB5
  *           @arg @ref FL_CANFD_RXMB6
  *           @arg @ref FL_CANFD_RXMB7
  *           @arg @ref FL_CANFD_RXMB8
  *           @arg @ref FL_CANFD_RXMB9
  *           @arg @ref FL_CANFD_RXMB10
  *           @arg @ref FL_CANFD_RXMB11
  *           @arg @ref FL_CANFD_RXMB12
  *           @arg @ref FL_CANFD_RXMB13
  *           @arg @ref FL_CANFD_RXMB14
  *           @arg @ref FL_CANFD_RXMB15
  *           @arg @ref FL_CANFD_RXMB16
  *           @arg @ref FL_CANFD_RXMB17
  *           @arg @ref FL_CANFD_RXMB18
  *           @arg @ref FL_CANFD_RXMB19
  *           @arg @ref FL_CANFD_RXMB20
  *           @arg @ref FL_CANFD_RXMB21
  *           @arg @ref FL_CANFD_RXMB22
  *           @arg @ref FL_CANFD_RXMB23
  *           @arg @ref FL_CANFD_RXMB24
  *           @arg @ref FL_CANFD_RXMB25
  *           @arg @ref FL_CANFD_RXMB26
  *           @arg @ref FL_CANFD_RXMB27
  *           @arg @ref FL_CANFD_RXMB28
  *           @arg @ref FL_CANFD_RXMB29
  *           @arg @ref FL_CANFD_RXMB30
  *           @arg @ref FL_CANFD_RXMB31
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_RxMBBitRateSwitch(CANFD_COMMON_Type* CANFDx, uint32_t rxmbX)
{
    return (uint32_t)(READ_BIT(RM(CANFDx, rxmbX).CFDRMFDSTSb, CANFD_CFDRMFDSTS_RMBRS_Msk) == (CANFD_CFDRMFDSTS_RMBRS_Msk));
}

/**
  * @brief    Get Global RX Message Buffer Error State Indicator bit
  * @rmtoll   CFDRMFDSTS    RMESI    FL_CANFD_Global_IsActiveFlag_RxMBErrorStateIndicator
  * @param    CANFDx CANFD instance
  * @param    rxmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXMB0
  *           @arg @ref FL_CANFD_RXMB1
  *           @arg @ref FL_CANFD_RXMB2
  *           @arg @ref FL_CANFD_RXMB3
  *           @arg @ref FL_CANFD_RXMB4
  *           @arg @ref FL_CANFD_RXMB5
  *           @arg @ref FL_CANFD_RXMB6
  *           @arg @ref FL_CANFD_RXMB7
  *           @arg @ref FL_CANFD_RXMB8
  *           @arg @ref FL_CANFD_RXMB9
  *           @arg @ref FL_CANFD_RXMB10
  *           @arg @ref FL_CANFD_RXMB11
  *           @arg @ref FL_CANFD_RXMB12
  *           @arg @ref FL_CANFD_RXMB13
  *           @arg @ref FL_CANFD_RXMB14
  *           @arg @ref FL_CANFD_RXMB15
  *           @arg @ref FL_CANFD_RXMB16
  *           @arg @ref FL_CANFD_RXMB17
  *           @arg @ref FL_CANFD_RXMB18
  *           @arg @ref FL_CANFD_RXMB19
  *           @arg @ref FL_CANFD_RXMB20
  *           @arg @ref FL_CANFD_RXMB21
  *           @arg @ref FL_CANFD_RXMB22
  *           @arg @ref FL_CANFD_RXMB23
  *           @arg @ref FL_CANFD_RXMB24
  *           @arg @ref FL_CANFD_RXMB25
  *           @arg @ref FL_CANFD_RXMB26
  *           @arg @ref FL_CANFD_RXMB27
  *           @arg @ref FL_CANFD_RXMB28
  *           @arg @ref FL_CANFD_RXMB29
  *           @arg @ref FL_CANFD_RXMB30
  *           @arg @ref FL_CANFD_RXMB31
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_RxMBErrorStateIndicator(CANFD_COMMON_Type* CANFDx, uint32_t rxmbX)
{
    return (uint32_t)(READ_BIT(RM(CANFDx, rxmbX).CFDRMFDSTSb, CANFD_CFDRMFDSTS_RMESI_Msk) == (CANFD_CFDRMFDSTS_RMESI_Msk));
}

/**
  * @brief    Get Global RX Message Buffer Data Field
  * @rmtoll   CFDRMDFp    RMDB    FL_CANFD_Global_ReadRxMBData
  * @param    CANFDx CANFD instance
  * @param    rxmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXMB0
  *           @arg @ref FL_CANFD_RXMB1
  *           @arg @ref FL_CANFD_RXMB2
  *           @arg @ref FL_CANFD_RXMB3
  *           @arg @ref FL_CANFD_RXMB4
  *           @arg @ref FL_CANFD_RXMB5
  *           @arg @ref FL_CANFD_RXMB6
  *           @arg @ref FL_CANFD_RXMB7
  *           @arg @ref FL_CANFD_RXMB8
  *           @arg @ref FL_CANFD_RXMB9
  *           @arg @ref FL_CANFD_RXMB10
  *           @arg @ref FL_CANFD_RXMB11
  *           @arg @ref FL_CANFD_RXMB12
  *           @arg @ref FL_CANFD_RXMB13
  *           @arg @ref FL_CANFD_RXMB14
  *           @arg @ref FL_CANFD_RXMB15
  *           @arg @ref FL_CANFD_RXMB16
  *           @arg @ref FL_CANFD_RXMB17
  *           @arg @ref FL_CANFD_RXMB18
  *           @arg @ref FL_CANFD_RXMB19
  *           @arg @ref FL_CANFD_RXMB20
  *           @arg @ref FL_CANFD_RXMB21
  *           @arg @ref FL_CANFD_RXMB22
  *           @arg @ref FL_CANFD_RXMB23
  *           @arg @ref FL_CANFD_RXMB24
  *           @arg @ref FL_CANFD_RXMB25
  *           @arg @ref FL_CANFD_RXMB26
  *           @arg @ref FL_CANFD_RXMB27
  *           @arg @ref FL_CANFD_RXMB28
  *           @arg @ref FL_CANFD_RXMB29
  *           @arg @ref FL_CANFD_RXMB30
  *           @arg @ref FL_CANFD_RXMB31
  * @param    dataX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_DATA0
  *           @arg @ref FL_CANFD_DATA1
  *           @arg @ref FL_CANFD_DATA2
  *           @arg @ref FL_CANFD_DATA3
  *           @arg @ref FL_CANFD_DATA4
  *           @arg @ref FL_CANFD_DATA5
  *           @arg @ref FL_CANFD_DATA6
  *           @arg @ref FL_CANFD_DATA7
  *           @arg @ref FL_CANFD_DATA8
  *           @arg @ref FL_CANFD_DATA9
  *           @arg @ref FL_CANFD_DATA10
  *           @arg @ref FL_CANFD_DATA11
  *           @arg @ref FL_CANFD_DATA12
  *           @arg @ref FL_CANFD_DATA13
  *           @arg @ref FL_CANFD_DATA14
  *           @arg @ref FL_CANFD_DATA15
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadRxMBData(CANFD_COMMON_Type* CANFDx, uint32_t rxmbX, uint32_t dataX)
{
    return (uint32_t)(READ_BIT(RM(CANFDx, rxmbX).CFDRMDFbp[dataX], (0xffffffffU << 0U)) >> 0U);
}

/**
  * @brief    Get Global RX FIFO Buffer IDE Bit 
  * @rmtoll   CFDRFID    RFIDE    FL_CANFD_Global_GetRxFIFOIDE
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_RF_IDE_STANDARD
  *           @arg @ref FL_CANFD_RF_IDE_EXTENDED
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetRxFIFOIDE(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    return (uint32_t)(READ_BIT(RF(CANFDx, rxfifoX).CFDRFIDb, CANFD_CFDRFID_RFIDE_Msk));
}

/**
  * @brief    Get Global RX FIFO Buffer RTR Bit 
  * @rmtoll   CFDRFID    RFRTR    FL_CANFD_Global_GetRxFIFORTR
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_RF_RTR_DATA_FRAME
  *           @arg @ref FL_CANFD_RF_RTR_REMOTE_FRAME
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetRxFIFORTR(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    return (uint32_t)(READ_BIT(RF(CANFDx, rxfifoX).CFDRFIDb, CANFD_CFDRFID_RFRTR_Msk));
}

/**
  * @brief    Get Global RX FIFO Buffer ID Field 
  * @rmtoll   CFDRFID    RFID    FL_CANFD_Global_ReadRxFIFOID
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadRxFIFOID(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    return (uint32_t)(READ_BIT(RF(CANFDx, rxfifoX).CFDRFIDb, (0x1fffffffU << 0U)) >> 0U);
}

/**
  * @brief    Get Global RX FIFO Buffer DLC Field 
  * @rmtoll   CFDRFPTR    RFDLC    FL_CANFD_Global_ReadRxFIFODLC
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadRxFIFODLC(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    return (uint32_t)(READ_BIT(RF(CANFDx, rxfifoX).CFDRFPTRb, (0xfU << 28U)) >> 28U);
}

/**
  * @brief    Get Global RX FIFO Buffer Timestamp Field 
  * @rmtoll   CFDRFPTR    RFTS    FL_CANFD_Global_ReadRxFIFOTimestamp
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadRxFIFOTimestamp(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    return (uint32_t)(READ_BIT(RF(CANFDx, rxfifoX).CFDRFPTRb, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get Global RX FIFO Buffer Pointer Field 
  * @rmtoll   CFDRFFDSTS    CFDRFPTR    FL_CANFD_Global_ReadRxFIFOPointer
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadRxFIFOPointer(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    return (uint32_t)(READ_BIT(RF(CANFDx, rxfifoX).CFDRFFDSTSb, (0xffffU << 16U)) >> 16U);
}

/**
  * @brief    Get Global RX FIFO Buffer Information label  Field 
  * @rmtoll   CFDRFFDSTS    RFIFL    FL_CANFD_Global_ReadRxFIFOInfoLabel
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadRxFIFOInfoLabel(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    return (uint32_t)(READ_BIT(RF(CANFDx, rxfifoX).CFDRFFDSTSb, (0x3U << 8U)) >> 8U);
}

/**
  * @brief    Get Global RX FIFO Buffer CAN FD Format bit
  * @rmtoll   CFDRFFDSTS    RFFDF    FL_CANFD_Global_IsActiveFlag_RxFIFOFDFormat
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_RxFIFOFDFormat(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    return (uint32_t)(READ_BIT(RF(CANFDx, rxfifoX).CFDRFFDSTSb, CANFD_CFDRFFDSTS_RFFDF_Msk) == (CANFD_CFDRFFDSTS_RFFDF_Msk));
}

/**
  * @brief    Get Global RX FIFO Buffer Bit Rate Switch bit
  * @rmtoll   CFDRFFDSTS    RFBRS    FL_CANFD_Global_IsActiveFlag_RxFIFOBitRateSwitch
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_RxFIFOBitRateSwitch(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    return (uint32_t)(READ_BIT(RF(CANFDx, rxfifoX).CFDRFFDSTSb, CANFD_CFDRFFDSTS_RFBRS_Msk) == (CANFD_CFDRFFDSTS_RFBRS_Msk));
}

/**
  * @brief    Get Global RX FIFO Buffer Error State Indicator bit
  * @rmtoll   CFDRFFDSTS    RFESI    FL_CANFD_Global_IsActiveFlag_RxFIFOErrorStateIndicator
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_RxFIFOErrorStateIndicator(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    return (uint32_t)(READ_BIT(RF(CANFDx, rxfifoX).CFDRFFDSTSb, CANFD_CFDRFFDSTS_RFESI_Msk) == (CANFD_CFDRFFDSTS_RFESI_Msk));
}

/**
  * @brief    Get Global RX FIFO Buffer Data Field
  * @rmtoll   CFDRFDFp    RFDB    FL_CANFD_Global_ReadRxFIFOData
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @param    dataX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_DATA0
  *           @arg @ref FL_CANFD_DATA1
  *           @arg @ref FL_CANFD_DATA2
  *           @arg @ref FL_CANFD_DATA3
  *           @arg @ref FL_CANFD_DATA4
  *           @arg @ref FL_CANFD_DATA5
  *           @arg @ref FL_CANFD_DATA6
  *           @arg @ref FL_CANFD_DATA7
  *           @arg @ref FL_CANFD_DATA8
  *           @arg @ref FL_CANFD_DATA9
  *           @arg @ref FL_CANFD_DATA10
  *           @arg @ref FL_CANFD_DATA11
  *           @arg @ref FL_CANFD_DATA12
  *           @arg @ref FL_CANFD_DATA13
  *           @arg @ref FL_CANFD_DATA14
  *           @arg @ref FL_CANFD_DATA15
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadRxFIFOData(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX, uint32_t dataX)
{
    return (uint32_t)(READ_BIT(RF(CANFDx, rxfifoX).CFDRFDFbp[dataX], (0xffffffffU << 0U)) >> 0U);
}

/**
  * @brief    Set Global Common FIFO Buffer IDE Bit
  * @rmtoll   CFDCFID    CFIDE    FL_CANFD_Global_SetCommonFIFOIDE
  * @param    CANFDx CANFD instance
  * @param    ide This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_CF_IDE_STANDARD
  *           @arg @ref FL_CANFD_CF_IDE_EXTENDED
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetCommonFIFOIDE(CANFD_COMMON_Type* CANFDx, uint32_t ide)
{
    MODIFY_REG(CF(CANFDx)->CFDCFID, CANFD_CFDCFID_CFIDE_Msk, ide);
}

/**
  * @brief    Get Global Common FIFO Buffer IDE Bit
  * @rmtoll   CFDCFID    CFIDE    FL_CANFD_Global_GetCommonFIFOIDE
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_CF_IDE_STANDARD
  *           @arg @ref FL_CANFD_CF_IDE_EXTENDED
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetCommonFIFOIDE(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CF(CANFDx)->CFDCFID, CANFD_CFDCFID_CFIDE_Msk));
}

/**
  * @brief    Set Global Common FIFO Buffer RTR Bit
  * @rmtoll   CFDCFID    CFRTR    FL_CANFD_Global_SetCommonFIFORTR
  * @param    CANFDx CANFD instance
  * @param    rtr This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_CF_RTR_DATA_FRAME
  *           @arg @ref FL_CANFD_CF_RTR_REMOTE_FRAME
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetCommonFIFORTR(CANFD_COMMON_Type* CANFDx, uint32_t rtr)
{
    MODIFY_REG(CF(CANFDx)->CFDCFID, CANFD_CFDCFID_CFRTR_Msk, rtr);
}

/**
  * @brief    Get Global Common FIFO Buffer RTR Bit
  * @rmtoll   CFDCFID    CFRTR    FL_CANFD_Global_GetCommonFIFORTR
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_CF_RTR_DATA_FRAME
  *           @arg @ref FL_CANFD_CF_RTR_REMOTE_FRAME
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetCommonFIFORTR(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CF(CANFDx)->CFDCFID, CANFD_CFDCFID_CFRTR_Msk));
}

/**
  * @brief    Global Common FIFO THL Entry enable 
  * @rmtoll   CFDCFID    THLEN    FL_CANFD_Global_Enable_CommonFIFOTxHistoryListEntry
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Enable_CommonFIFOTxHistoryListEntry(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CF(CANFDx)->CFDCFID, CANFD_CFDCFID_THLEN_Msk);
}

/**
  * @brief    Global Common FIFO THL Entry enable status 
  * @rmtoll   CFDCFID    THLEN    FL_CANFD_Global_IsEnabled_CommonFIFOTxHistoryListEntry
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabled_CommonFIFOTxHistoryListEntry(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CF(CANFDx)->CFDCFID, CANFD_CFDCFID_THLEN_Msk) == CANFD_CFDCFID_THLEN_Msk);
}

/**
  * @brief    Global Common FIFO THL Entry disable 
  * @rmtoll   CFDCFID    THLEN    FL_CANFD_Global_Disable_CommonFIFOTxHistoryListEntry
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Disable_CommonFIFOTxHistoryListEntry(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CF(CANFDx)->CFDCFID, CANFD_CFDCFID_THLEN_Msk);
}

/**
  * @brief    Set Global Common FIFO Buffer ID Field
  * @rmtoll   CFDCFID    CFID    FL_CANFD_Global_WriteCommonFIFOID
  * @param    CANFDx CANFD instance
  * @param    id 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteCommonFIFOID(CANFD_COMMON_Type* CANFDx, uint32_t id)
{
    MODIFY_REG(CF(CANFDx)->CFDCFID, (0x1fffffffU << 0U), (id << 0U));
}

/**
  * @brief    Get Global Common FIFO Buffer ID Field
  * @rmtoll   CFDCFID    CFID    FL_CANFD_Global_ReadCommonFIFOID
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadCommonFIFOID(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CF(CANFDx)->CFDCFID, (0x1fffffffU << 0U)) >> 0U);
}

/**
  * @brief    Set Global Common FIFO Buffer DLC Field
  * @rmtoll   CFDCFPTR    CFDLC    FL_CANFD_Global_WriteCommonFIFODLC
  * @param    CANFDx CANFD instance
  * @param    dlc 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteCommonFIFODLC(CANFD_COMMON_Type* CANFDx, uint32_t dlc)
{
    MODIFY_REG(CF(CANFDx)->CFDCFPTR, (0xfU << 28U), (dlc << 28U));
}

/**
  * @brief    Get Global Common FIFO Buffer DLC Field
  * @rmtoll   CFDCFPTR    CFDLC    FL_CANFD_Global_ReadCommonFIFODLC
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadCommonFIFODLC(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CF(CANFDx)->CFDCFPTR, (0xfU << 28U)) >> 28U);
}

