Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_canfd.h
/**
  * @brief    Set Global Common FIFO Timestamp Value
  * @rmtoll   CFDCFPTR    CFTS    FL_CANFD_Global_WriteCommonFIFOTimestamp
  * @param    CANFDx CANFD instance
  * @param    time 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteCommonFIFOTimestamp(CANFD_COMMON_Type* CANFDx, uint32_t time)
{
    MODIFY_REG(CF(CANFDx)->CFDCFPTR, (0xffffU << 0U), (time << 0U));
}

/**
  * @brief    Get Global Common FIFO Timestamp Value
  * @rmtoll   CFDCFPTR    CFTS    FL_CANFD_Global_ReadCommonFIFOTimestamp
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadCommonFIFOTimestamp(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CF(CANFDx)->CFDCFPTR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get Global Common FIFO Buffer Pointer Field 
  * @rmtoll   CFDCFFDCSTS    CFPTR    FL_CANFD_Global_ReadCommonFIFOPointer
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadCommonFIFOPointer(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CF(CANFDx)->CFDCFFDCSTS, (0xffffU << 16U)) >> 16U);
}

/**
  * @brief    Set Global Common FIFO Buffer Information label  Field 
  * @rmtoll   CFDCFFDCSTS    CFIFL    FL_CANFD_Global_WriteCommonFIFOInfoLabel
  * @param    CANFDx CANFD instance
  * @param    label 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteCommonFIFOInfoLabel(CANFD_COMMON_Type* CANFDx, uint32_t label)
{
    MODIFY_REG(CF(CANFDx)->CFDCFFDCSTS, (0x3U << 8U), (label << 8U));
}

/**
  * @brief    Get Global Common FIFO Buffer Information label  Field 
  * @rmtoll   CFDCFFDCSTS    CFIFL    FL_CANFD_Global_ReadCommonFIFOInfoLabel
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadCommonFIFOInfoLabel(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CF(CANFDx)->CFDCFFDCSTS, (0x3U << 8U)) >> 8U);
}

/**
  * @brief    Set Global Common FIFO Buffer CAN FD Format bit
  * @rmtoll   CFDCFFDCSTS    CFFDF    FL_CANFD_Global_SetCommonFIFOFDFormat
  * @param    CANFDx CANFD instance
  * @param    fdf This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_CF_FDF_DISABLE
  *           @arg @ref FL_CANFD_CF_FDF_ENABLE
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetCommonFIFOFDFormat(CANFD_COMMON_Type* CANFDx, uint32_t fdf)
{
    MODIFY_REG(CF(CANFDx)->CFDCFFDCSTS, CANFD_CFDCFFDCSTS_CFFDF_Msk, fdf);
}

/**
  * @brief    Get Global Common FIFO Buffer CAN FD Format bit
  * @rmtoll   CFDCFFDCSTS    CFFDF    FL_CANFD_Global_GetCommonFIFOFDFormat
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_CF_FDF_DISABLE
  *           @arg @ref FL_CANFD_CF_FDF_ENABLE
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetCommonFIFOFDFormat(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CF(CANFDx)->CFDCFFDCSTS, CANFD_CFDCFFDCSTS_CFFDF_Msk));
}

/**
  * @brief    Set Global Common FIFO Buffer Bit Rate Switch bit
  * @rmtoll   CFDCFFDCSTS    CFBRS    FL_CANFD_Global_SetCommonFIFOBitRateSwitch
  * @param    CANFDx CANFD instance
  * @param    brs This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_CF_BRS_DISABLE
  *           @arg @ref FL_CANFD_CF_BRS_ENABLE
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetCommonFIFOBitRateSwitch(CANFD_COMMON_Type* CANFDx, uint32_t brs)
{
    MODIFY_REG(CF(CANFDx)->CFDCFFDCSTS, CANFD_CFDCFFDCSTS_CFBRS_Msk, brs);
}

/**
  * @brief    Get Global Common FIFO Buffer Bit Rate Switch bit
  * @rmtoll   CFDCFFDCSTS    CFBRS    FL_CANFD_Global_GetCommonFIFOBitRateSwitch
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_CF_BRS_DISABLE
  *           @arg @ref FL_CANFD_CF_BRS_ENABLE
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetCommonFIFOBitRateSwitch(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CF(CANFDx)->CFDCFFDCSTS, CANFD_CFDCFFDCSTS_CFBRS_Msk));
}

/**
  * @brief    Set Global Common FIFO Buffer Error State Indicator bit 
  * @rmtoll   CFDCFFDCSTS    CFESI    FL_CANFD_Global_SetCommonFIFOErrorStateIndicator
  * @param    CANFDx CANFD instance
  * @param    esi This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_CF_ESI_DISABLE
  *           @arg @ref FL_CANFD_CF_ESI_ENABLE
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetCommonFIFOErrorStateIndicator(CANFD_COMMON_Type* CANFDx, uint32_t esi)
{
    MODIFY_REG(CF(CANFDx)->CFDCFFDCSTS, CANFD_CFDCFFDCSTS_CFESI_Msk, esi);
}

/**
  * @brief    Get Global Common FIFO Buffer Error State Indicator bit 
  * @rmtoll   CFDCFFDCSTS    CFESI    FL_CANFD_Global_GetCommonFIFOErrorStateIndicator
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_CF_ESI_DISABLE
  *           @arg @ref FL_CANFD_CF_ESI_ENABLE
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetCommonFIFOErrorStateIndicator(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CF(CANFDx)->CFDCFFDCSTS, CANFD_CFDCFFDCSTS_CFESI_Msk));
}

/**
  * @brief    Set Global Common FIFO Buffer Data  Field 
  * @rmtoll   CFDCFDFp    CFDB    FL_CANFD_Global_WriteCommonFIFOData
  * @param    CANFDx CANFD instance
  * @param    dataX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_DATA0
  *           @arg @ref FL_CANFD_DATA1
  *           @arg @ref FL_CANFD_DATA2
  *           @arg @ref FL_CANFD_DATA3
  *           @arg @ref FL_CANFD_DATA4
  *           @arg @ref FL_CANFD_DATA5
  *           @arg @ref FL_CANFD_DATA6
  *           @arg @ref FL_CANFD_DATA7
  *           @arg @ref FL_CANFD_DATA8
  *           @arg @ref FL_CANFD_DATA9
  *           @arg @ref FL_CANFD_DATA10
  *           @arg @ref FL_CANFD_DATA11
  *           @arg @ref FL_CANFD_DATA12
  *           @arg @ref FL_CANFD_DATA13
  *           @arg @ref FL_CANFD_DATA14
  *           @arg @ref FL_CANFD_DATA15
  * @param    data 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteCommonFIFOData(CANFD_COMMON_Type* CANFDx, uint32_t dataX, uint32_t data)
{
    MODIFY_REG(CF(CANFDx)->CFDCFDFp[dataX], (0xffffffffU << 0U), (data << 0U));
}

/**
  * @brief    Get Global Common FIFO Buffer Data  Field 
  * @rmtoll   CFDCFDFp    CFDB    FL_CANFD_Global_ReadCommonFIFOData
  * @param    CANFDx CANFD instance
  * @param    dataX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_DATA0
  *           @arg @ref FL_CANFD_DATA1
  *           @arg @ref FL_CANFD_DATA2
  *           @arg @ref FL_CANFD_DATA3
  *           @arg @ref FL_CANFD_DATA4
  *           @arg @ref FL_CANFD_DATA5
  *           @arg @ref FL_CANFD_DATA6
  *           @arg @ref FL_CANFD_DATA7
  *           @arg @ref FL_CANFD_DATA8
  *           @arg @ref FL_CANFD_DATA9
  *           @arg @ref FL_CANFD_DATA10
  *           @arg @ref FL_CANFD_DATA11
  *           @arg @ref FL_CANFD_DATA12
  *           @arg @ref FL_CANFD_DATA13
  *           @arg @ref FL_CANFD_DATA14
  *           @arg @ref FL_CANFD_DATA15
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadCommonFIFOData(CANFD_COMMON_Type* CANFDx, uint32_t dataX)
{
    return (uint32_t)(READ_BIT(CF(CANFDx)->CFDCFDFp[dataX], (0xffffffffU << 0U)) >> 0U);
}

/**
  * @brief    Set Global TX Message Buffer IDE Bit
  * @rmtoll   CFDTMID    TMIDE    FL_CANFD_Global_SetTxMBIDE
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @param    ide This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TM_IDE_STANDARD
  *           @arg @ref FL_CANFD_TM_IDE_EXTENDED
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetTxMBIDE(CANFD_COMMON_Type* CANFDx, uint32_t txmbX, uint32_t ide)
{
    MODIFY_REG(TM(CANFDx, txmbX).CFDTMIDb, CANFD_CFDTMID_TMIDE_Msk, ide);
}

/**
  * @brief    Get Global TX Message Buffer IDE Bit
  * @rmtoll   CFDTMID    TMIDE    FL_CANFD_Global_GetTxMBIDE
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_TM_IDE_STANDARD
  *           @arg @ref FL_CANFD_TM_IDE_EXTENDED
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetTxMBIDE(CANFD_COMMON_Type* CANFDx, uint32_t txmbX)
{
    return (uint32_t)(READ_BIT(TM(CANFDx, txmbX).CFDTMIDb, CANFD_CFDTMID_TMIDE_Msk));
}

/**
  * @brief    Set Global TX Message Buffer RTR Bit
  * @rmtoll   CFDTMID    TMRTR    FL_CANFD_Global_SetTxMBRTR
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @param    rtr This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TM_RTR_DATA_FRAME
  *           @arg @ref FL_CANFD_TM_RTR_REMOTE_FRAME
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetTxMBRTR(CANFD_COMMON_Type* CANFDx, uint32_t txmbX, uint32_t rtr)
{
    MODIFY_REG(TM(CANFDx, txmbX).CFDTMIDb, CANFD_CFDTMID_TMRTR_Msk, rtr);
}

/**
  * @brief    Get Global TX Message Buffer RTR Bit
  * @rmtoll   CFDTMID    TMRTR    FL_CANFD_Global_GetTxMBRTR
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_TM_RTR_DATA_FRAME
  *           @arg @ref FL_CANFD_TM_RTR_REMOTE_FRAME
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetTxMBRTR(CANFD_COMMON_Type* CANFDx, uint32_t txmbX)
{
    return (uint32_t)(READ_BIT(TM(CANFDx, txmbX).CFDTMIDb, CANFD_CFDTMID_TMRTR_Msk));
}

/**
  * @brief    Global TX Message THL Entry enable 
  * @rmtoll   CFDTMID    THLEN    FL_CANFD_Global_Enable_TxMBTxHistoryListEntry
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Enable_TxMBTxHistoryListEntry(CANFD_COMMON_Type* CANFDx, uint32_t txmbX)
{
    SET_BIT(TM(CANFDx, txmbX).CFDTMIDb, CANFD_CFDTMID_THLEN_Msk);
}

/**
  * @brief    Global TX Message THL Entry enable status 
  * @rmtoll   CFDTMID    THLEN    FL_CANFD_Global_IsEnabled_TxMBTxHistoryListEntry
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabled_TxMBTxHistoryListEntry(CANFD_COMMON_Type* CANFDx, uint32_t txmbX)
{
    return (uint32_t)(READ_BIT(TM(CANFDx, txmbX).CFDTMIDb, CANFD_CFDTMID_THLEN_Msk) == CANFD_CFDTMID_THLEN_Msk);
}

/**
  * @brief    Global TX Message THL Entry disable 
  * @rmtoll   CFDTMID    THLEN    FL_CANFD_Global_Disable_TxMBTxHistoryListEntry
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Disable_TxMBTxHistoryListEntry(CANFD_COMMON_Type* CANFDx, uint32_t txmbX)
{
    CLEAR_BIT(TM(CANFDx, txmbX).CFDTMIDb, CANFD_CFDTMID_THLEN_Msk);
}

/**
  * @brief    Set Global TX Message Buffer ID Field
  * @rmtoll   CFDTMID    TMID    FL_CANFD_Global_WriteTxMBID
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @param    id 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteTxMBID(CANFD_COMMON_Type* CANFDx, uint32_t txmbX, uint32_t id)
{
    MODIFY_REG(TM(CANFDx, txmbX).CFDTMIDb, (0x1fffffffU << 0U), (id << 0U));
}

/**
  * @brief    Get Global TX Message Buffer ID Field
  * @rmtoll   CFDTMID    TMID    FL_CANFD_Global_ReadTxMBID
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadTxMBID(CANFD_COMMON_Type* CANFDx, uint32_t txmbX)
{
    return (uint32_t)(READ_BIT(TM(CANFDx, txmbX).CFDTMIDb, (0x1fffffffU << 0U)) >> 0U);
}

/**
  * @brief    Set Global TX Message Buffer DLC Field
  * @rmtoll   CFDTMPTR    TMDLC    FL_CANFD_Global_WriteTxMBDLC
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @param    dlc 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteTxMBDLC(CANFD_COMMON_Type* CANFDx, uint32_t txmbX, uint32_t dlc)
{
    MODIFY_REG(TM(CANFDx, txmbX).CFDTMPTRb, (0xfU << 28U), (dlc << 28U));
}

/**
  * @brief    Get Global TX Message Buffer DLC Field
  * @rmtoll   CFDTMPTR    TMDLC    FL_CANFD_Global_ReadTxMBDLC
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadTxMBDLC(CANFD_COMMON_Type* CANFDx, uint32_t txmbX)
{
    return (uint32_t)(READ_BIT(TM(CANFDx, txmbX).CFDTMPTRb, (0xfU << 28U)) >> 28U);
}

/**
  * @brief    Set Global TX Message Buffer Pointer Field 
  * @rmtoll   CFDTMFDCTR    TMPTR    FL_CANFD_Global_WriteTxMBPointer
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @param    pointer 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteTxMBPointer(CANFD_COMMON_Type* CANFDx, uint32_t txmbX, uint32_t pointer)
{
    MODIFY_REG(TM(CANFDx, txmbX).CFDTMFDCTRb, (0xffffU << 16U), (pointer << 16U));
}

/**
  * @brief    Get Global TX Message Buffer Pointer Field 
  * @rmtoll   CFDTMFDCTR    TMPTR    FL_CANFD_Global_ReadTxMBPointer
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadTxMBPointer(CANFD_COMMON_Type* CANFDx, uint32_t txmbX)
{
    return (uint32_t)(READ_BIT(TM(CANFDx, txmbX).CFDTMFDCTRb, (0xffffU << 16U)) >> 16U);
}

/**
  * @brief    Set Global TX Message Buffer Information label  Field 
  * @rmtoll   CFDTMFDCTR    TMIFL    FL_CANFD_Global_WriteTxMBInfoLabel
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @param    label 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteTxMBInfoLabel(CANFD_COMMON_Type* CANFDx, uint32_t txmbX, uint32_t label)
{
    MODIFY_REG(TM(CANFDx, txmbX).CFDTMFDCTRb, (0x3U << 8U), (label << 8U));
}

/**
  * @brief    Get Global TX Message Buffer Information label  Field 
  * @rmtoll   CFDTMFDCTR    TMIFL    FL_CANFD_Global_ReadTxMBInfoLabel
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadTxMBInfoLabel(CANFD_COMMON_Type* CANFDx, uint32_t txmbX)
{
    return (uint32_t)(READ_BIT(TM(CANFDx, txmbX).CFDTMFDCTRb, (0x3U << 8U)) >> 8U);
}

/**
  * @brief    Set Global TX Message Buffer CAN FD Format bit
  * @rmtoll   CFDTMFDCTR    TMFDF    FL_CANFD_Global_SetTxMBFDFormat
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @param    fdf This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TM_FDF_DISABLE
  *           @arg @ref FL_CANFD_TM_FDF_ENABLE
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetTxMBFDFormat(CANFD_COMMON_Type* CANFDx, uint32_t txmbX, uint32_t fdf)
{
    MODIFY_REG(TM(CANFDx, txmbX).CFDTMFDCTRb, CANFD_CFDTMFDCTR_TMFDF_Msk, fdf);
}

/**
  * @brief    Get Global TX Message Buffer CAN FD Format bit
  * @rmtoll   CFDTMFDCTR    TMFDF    FL_CANFD_Global_GetTxMBFDFormat
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_TM_FDF_DISABLE
  *           @arg @ref FL_CANFD_TM_FDF_ENABLE
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetTxMBFDFormat(CANFD_COMMON_Type* CANFDx, uint32_t txmbX)
{
    return (uint32_t)(READ_BIT(TM(CANFDx, txmbX).CFDTMFDCTRb, CANFD_CFDTMFDCTR_TMFDF_Msk));
}

/**
  * @brief    Set Global TX Message Buffer Bit Rate Switch bit
  * @rmtoll   CFDTMFDCTR    TMBRS    FL_CANFD_Global_SetTxMBBitRateSwitch
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @param    brs This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TM_BRS_DISABLE
  *           @arg @ref FL_CANFD_TM_BRS_ENABLE
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetTxMBBitRateSwitch(CANFD_COMMON_Type* CANFDx, uint32_t txmbX, uint32_t brs)
{
    MODIFY_REG(TM(CANFDx, txmbX).CFDTMFDCTRb, CANFD_CFDTMFDCTR_TMBRS_Msk, brs);
}

/**
  * @brief    Get Global TX Message Buffer Bit Rate Switch bit
  * @rmtoll   CFDTMFDCTR    TMBRS    FL_CANFD_Global_GetTxMBBitRateSwitch
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_TM_BRS_DISABLE
  *           @arg @ref FL_CANFD_TM_BRS_ENABLE
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetTxMBBitRateSwitch(CANFD_COMMON_Type* CANFDx, uint32_t txmbX)
{
    return (uint32_t)(READ_BIT(TM(CANFDx, txmbX).CFDTMFDCTRb, CANFD_CFDTMFDCTR_TMBRS_Msk));
}

/**
  * @brief    Set Global TX Message Buffer Error State Indicator bit 
  * @rmtoll   CFDTMFDCTR    TMESI    FL_CANFD_Global_SetTxMBErrorStateIndicator
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @param    esi This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TM_ESI_DISABLE
  *           @arg @ref FL_CANFD_TM_ESI_ENABLE
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetTxMBErrorStateIndicator(CANFD_COMMON_Type* CANFDx, uint32_t txmbX, uint32_t esi)
{
    MODIFY_REG(TM(CANFDx, txmbX).CFDTMFDCTRb, CANFD_CFDTMFDCTR_TMESI_Msk, esi);
}

/**
  * @brief    Get Global TX Message Buffer Error State Indicator bit 
  * @rmtoll   CFDTMFDCTR    TMESI    FL_CANFD_Global_GetTxMBErrorStateIndicator
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_TM_ESI_DISABLE
  *           @arg @ref FL_CANFD_TM_ESI_ENABLE
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetTxMBErrorStateIndicator(CANFD_COMMON_Type* CANFDx, uint32_t txmbX)
{
    return (uint32_t)(READ_BIT(TM(CANFDx, txmbX).CFDTMFDCTRb, CANFD_CFDTMFDCTR_TMESI_Msk));
}

/**
  * @brief    Set Global TX Message Buffer Data  Field 
  * @rmtoll   CFDTMDFp    TMDB    FL_CANFD_Global_WriteTxMBData
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @param    dataX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_DATA0
  *           @arg @ref FL_CANFD_DATA1
  *           @arg @ref FL_CANFD_DATA2
  *           @arg @ref FL_CANFD_DATA3
  *           @arg @ref FL_CANFD_DATA4
  *           @arg @ref FL_CANFD_DATA5
  *           @arg @ref FL_CANFD_DATA6
  *           @arg @ref FL_CANFD_DATA7
  *           @arg @ref FL_CANFD_DATA8
  *           @arg @ref FL_CANFD_DATA9
  *           @arg @ref FL_CANFD_DATA10
  *           @arg @ref FL_CANFD_DATA11
  *           @arg @ref FL_CANFD_DATA12
  *           @arg @ref FL_CANFD_DATA13
  *           @arg @ref FL_CANFD_DATA14
  *           @arg @ref FL_CANFD_DATA15
  * @param    data 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteTxMBData(CANFD_COMMON_Type* CANFDx, uint32_t txmbX, uint32_t dataX, uint32_t data)
{
    MODIFY_REG(TM(CANFDx, txmbX).CFDTMDFbp[dataX], (0xffffffffU << 0U), (data << 0U));
}

