Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_canfd.h
/**
  * @brief    Get Global TX Message Buffer Data  Field 
  * @rmtoll   CFDTMDFp    TMDB    FL_CANFD_Global_ReadTxMBData
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @param    dataX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_DATA0
  *           @arg @ref FL_CANFD_DATA1
  *           @arg @ref FL_CANFD_DATA2
  *           @arg @ref FL_CANFD_DATA3
  *           @arg @ref FL_CANFD_DATA4
  *           @arg @ref FL_CANFD_DATA5
  *           @arg @ref FL_CANFD_DATA6
  *           @arg @ref FL_CANFD_DATA7
  *           @arg @ref FL_CANFD_DATA8
  *           @arg @ref FL_CANFD_DATA9
  *           @arg @ref FL_CANFD_DATA10
  *           @arg @ref FL_CANFD_DATA11
  *           @arg @ref FL_CANFD_DATA12
  *           @arg @ref FL_CANFD_DATA13
  *           @arg @ref FL_CANFD_DATA14
  *           @arg @ref FL_CANFD_DATA15
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadTxMBData(CANFD_COMMON_Type* CANFDx, uint32_t txmbX, uint32_t dataX)
{
    return (uint32_t)(READ_BIT(TM(CANFDx, txmbX).CFDTMDFbp[dataX], (0xffffffffU << 0U)) >> 0U);
}

/**
  * @}
  */

/** @defgroup CANFD_FL_EF_Init Initialization and de-initialization functions
  * @{
  */

FL_ErrorStatus FL_CANFD_Init(CANFD_COMMON_Type *CANFDx, FL_CANFD_InitTypeDef *CANFD_InitStruct);


/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LD5XX_FL_CANFD_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2023-08-08*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
